import pandas as pd

df = pd.read_excel('exam.xlsx')

# df = df.loc[((df['Выборка']=='Тестовая') | (df['Выборка']=='Тест'))& ((df["Формат магазина"]=="Стрит") |(df["Формат магазина"]=="Стрт")|(df["Формат магазина"]=="Street"))|(df["Формат магазина"]=="Strееt")]
print("Магазинов формата стрит в тестовой выборке:",df.loc[((df['Выборка']=='Тестовая') | (df['Выборка']=='Тест'))& ((df["Формат магазина"]=="Стрит") |(df["Формат магазина"]=="Стрт")|(df["Формат магазина"]=="Street"))|(df["Формат магазина"]=="Strееt")]['id точки'].count())