import pandas as pd

df1 = pd.read_excel('exam.xlsx')
df2 = pd.read_excel('exam.xlsx', sheet_name="Выручка по обучающей выборке")

test = df1.loc[(df1["Формат магазина"]=='Мини ТЦ')| (df1["Формат магазина"]=='Мини-ТЦ')]
test = test['id точки']

ans = df2.loc[df2["id точки"].isin(test)]

ans = ans.dropna(subset=['id точки'])

ans = ans[['id точки',"2016-01-01",'2016-02-01','2016-03-01','2016-04-01','2016-05-01','2016-06-01','2016-07-01','2016-08-01','2016-09-01','2016-10-01','2016-11-01','2016-12-01']]




ans["mean"] = ans[["2016-01-01",'2016-02-01','2016-03-01','2016-04-01','2016-05-01','2016-06-01','2016-07-01','2016-08-01','2016-09-01','2016-10-01','2016-11-01','2016-12-01']].mean(numeric_only=True,axis=1)
ans = ans[['id точки', 'mean']]
ans = ans.mean(axis=0)
print("Средняя выручка магазинов формата мини ТЦ за 2016 год: ", ans['mean'])
